{
  "CareerData": [
    {
      "Genre": "Experiences",
      "Experiences": [
        {
          "Name": "Data Scientist",
          "key": "digital",
          "textcolor": "black",
          "Company": "Digital Agency-デジタル庁",
          "Location": "Tokyo, Japan",
          "Start": "2025-08-01",
          "Descriptions": [
            "Incoming Data Scientist @ Digital Agency(デジタル庁)",
            "Contributing to the development of platforms for the Japanese government to improve delivery of public services"
          ]
        },
        {
          "Name": "AI/Robotics Researcher",
          "key": "lsy",
          "textcolor": "black",
          "Company": "Learning Systems Robotics Lab at TUM",
          "Location": "Munich, Germany",
          "Start": "2024-05-01",
          "End": "2024-08-31",
          "RelatedLinks": [
            "https://github.com/kkatodus/rt1_controller_for_stretch",
            "https://github.com/kkatodus/dm_control"
          ],
          "videoLink": "https://www.youtube.com/embed/433Mq2W6Bzo?si=6Z55jKmsnivqeOZf",
          "Keywords": [
            "AI",
            "LLM",
            "Robotics",
            "ROS2",
            "Mujoco",
            "RL",
            "Research",
            "NLP"
          ],
          "Descriptions": [
            "Worked towards integrating LLMs into robotic controls to enable semantically nuanced behaviour of human assisting robots",
            "Developed a simulation environment for the Stretch 3 platform to test out the deployment of RT1 model on the platform",
            "Integrated RT1 model developed by Google DeepMind on the physical Stretch 3 platform to successfully conduct picking up tasks",
            "Designed soft-material robotic grippers and iterated on the design to successfully create a motor actuated soft gripper"
          ]
        },
        {
          "Name": "NLP Researcher",
          "key": "uoft",
          "Company": "University of Toronto",
          "Location": "Toronto, Canada",
          "Start": "2023-10-01",
          "End": "2024-04-31",
          "DownloadableDocuments": [
            {
              "Text": "Poster Presentation at PolMeth 2024",
              "link": "./L(u)PIN LLM-based Political Ideology Nowcasting.pdf"
            }
          ],
          "RelatedLinks": ["https://arxiv.org/abs/2405.07320"],
          "Keywords": [
            "NLP",
            "LLM",
            "Japanese Politics",
            "Political Science",
            "Research",
            "Political Methodology",
            "Publication",
            "PolMeth2024"
          ],
          "Descriptions": [
            "Worked as a NLP researcher under co-supervision of Prof. Raeid Saqur and Dr. Christopher Cochrane to work on a paper exploring the use of LLM in the analysis of parliamentary speeches of Japanese legislators to predict their ideological stances in regards to various political topics.",
            "Fine-tuned a BERT model to classify speech segments into opinion, factual, descriptive, other sentence types",
            "Conducted statistical analysis on the retrieved embeddings to explain political stances of legislators",
            "Published paper 'L(u)PIN: LLM-based Political Ideology Nowcasting' on arxiv. ",
            "Presenting a poster in the PolMeth 2024 conference at UC Riverside."
          ]
        },
        {
          "Name": "NLP Researcher",
          "key": "vector",
          "Company": "Vector Institute",
          "Location": "Toronto, Canada",
          "Start": "2023-10-01",
          "End": "2024-04-31",
          "Keywords": [
            "NLP",
            "LLM",
            "Finance",
            "Prompt Engineering",
            "Publication",
            "Research"
          ],
          "RelatedLinks": ["https://arxiv.org/abs/2405.09747"],
          "Descriptions": [
            "We introduce and make publicly available the NIFTY Financial News Headlines dataset, designed to facilitate and advance research in financial market forecasting using large language models (LLMs). This dataset comprises two distinct versions tailored for different modeling approaches: (i) NIFTY-LM, which targets supervised fine-tuning (SFT) of LLMs with an auto-regressive, causal language-modeling objective, and (ii) NIFTY-RL, formatted specifically for alignment methods (like reinforcement learning from human feedback (RLHF)) to align LLMs via rejection sampling and reward modeling. Each dataset version provides curated, high-quality data incorporating comprehensive metadata, market indices, and deduplicated financial news headlines systematically filtered and ranked to suit modern LLM frameworks. We also include experiments demonstrating some applications of the dataset in tasks like stock price movement and the role of LLM embeddings in information acquisition/richness. The NIFTY dataset along with utilities (like truncating prompt's context length systematically) are available on Hugging Face at this https URL."
          ]
        },
        {
          "Name": "Software Engineer Co-op Intern",
          "key": "hf",
          "Company": "Hellofresh Canada",
          "Location": "Toronto, Canada",
          "Start": "2023-05-01",
          "End": "2024-04-31",
          "Keywords": [
            "React",
            "Frontend Development",
            "Web",
            "Agile Workflow",
            "Cypress",
            "React Testing Library",
            "Honeycomb",
            "Google Analytics",
            "Statsig",
            "Optimizely",
            "TypeScript",
            "NextJS"
          ],
          "Descriptions": [
            "Accelerated the development of the rapidly expanding web platform for HelloFresh and its sub-brands including ChefsPlate, Factor, GreenChef, and EveryPlate, enhancing global user access.",
            "Worked with a NextJS and TypeScript stack to develop new features and improve existing ones, including the implementation of a new user onboarding flow and the integration of a new payment gateway.",
            "Engineered and executed end-to-end tests with Cypress and developed unit tests with React Testing Library to ensure software performance.",
            "Established monitoring protocols using Honeycomb, implemented Google Analytics tracking, and led A/B testing initiatives with Statsig and Optimizely to optimise user experience and operational efficiency."
          ]
        },
        {
          "Name": "Censorship Researcher",
          "key": "citizen",
          "textcolor": "black",
          "Company": "Citizen Lab at University of Toronto",
          "Location": "Toronto, Canada",
          "Start": "2022-05-01",
          "End": "2023-02-31",
          "Keywords": [
            "Censorship",
            "NLP",
            "Web Scraping",
            "Research",
            "Publication"
          ],
          "RelatedLinks": [
            "https://citizenlab.ca/2023/04/a-comparison-of-search-censorship-in-china/",
            "https://www.nytimes.com/2023/04/26/business/china-censored-search-engine.html"
          ],
          "Descriptions": [
            "Working as a research fellow at the Citizen Lab in the University of Toronto. ",
            "Received funding worth more than $6000 as a ESROP(Engineering Science Research Opportunity Program) fellow from the Division of Engineering Science and Citizen Lab. ",
            "Contributed to the research done by Dr. Jeffrey Knockel, analyzing the censorship implementation in search engines operated by Chinese ISPs. ",
            "Published the work done on the Citizen Lab website.",
            "Publication featured on the New York Times"
          ]
        },
        {
          "Name": "Software Engineer Intern",
          "Location": "Tokyo, Japan",
          "key": "kke",
          "textcolor": "black",
          "Company": "Kozo Keikaku Engineering Inc.",
          "Start": "2020-05-01",
          "End": "2021-06-30",
          "Keywords": [
            "SOLIDWORKS",
            "PARTICLEWORKS",
            "Web Dev",
            "Frontend Development",
            "Backend Development",
            "NLP",
            "Deep Reinforcement Learning",
            "C++",
            "Flask",
            "HTML",
            "CSS",
            "JS",
            "Mecab",
            "Gensim",
            "Tensorflow"
          ],
          "Descriptions": [
            "Structural analysis using the SOLIDWORKS Simulation as well as fluid flow analysis using SOLIDWORKS Flow Simulation and Particle Works",
            "Implementation of physical models using C++",
            "Full-stack product development in flask and HTML, CSS and JS",
            "Contributing to the NLP product development of the division, using Mecab and gensim",
            "Deep reinforcement learning experience, implementing models such as A2C, REINFORCE and DQN in tensorflow."
          ]
        },
        {
          "Name": "Business Consultant Intern",
          "Company": "PwC",
          "key": "pwc",
          "textcolor": "black",
          "Location": "Tokyo, Japan",
          "Start": "2020-08-01",
          "End": "2020-08-31",
          "Keywords": ["Consulting", "Business", "Business Strategy"],
          "Descriptions": [
            "Worked as a business strategy consultant intern at PwC Japan",
            "Advised real-life clients on their future business strategy and operations",
            "Worked together with a team of interns to put together a final pitch to the clients"
          ]
        },
        {
          "Name": "U14 Football Coach",
          "Location": "Dusseldorf, Germany",
          "Company": "SC West Düsseldorf e.V.",
          "key": "scwest",
          "textcolor": "black",
          "Start": "2016-06-01",
          "End": "2019-02-31",
          "Keywords": [
            "Leadership",
            "Football",
            "Coaching",
            "Teamwork",
            "Communication"
          ],
          "Descriptions": [
            "Worked as a U14 football coach to train a team composed of Japanese and German players."
          ]
        },
        {
          "Name": "Heavy Machinery Student Intern",
          "Company": "SIEMENS AG",
          "key": "siemens",
          "textcolor": "black",
          "Location": "Dusseldorf, Germany",
          "Start": "2017-06-01",
          "End": "2017-07-31",
          "Keywords": [
            "Welding",
            "Heavy Industry",
            "Metal Works",
            "Mechanical Engineering"
          ],
          "Descriptions": [
            "As a student intern at SIEMENS AG, I was exposed to first hand experience of mechanical engineering by assembling mechanical parts and welding; which I enjoyed the most. This was a precious experience for me because this was what convinced me to pursue engineering in university."
          ]
        }
      ]
    },
    {
      "Genre": "Education",
      "Experiences": [
        {
          "Name": "University of Toronto - Engineering Science",
          "Location": "Toronto, Canada",
          "key": "uoft",
          "Start": "2019-09-01",
          "End": "2025-04-30",
          "Keywords": ["Engineering Science", "Machine Intelligence"],
          "Descriptions": [
            "I graduated from the University of Toronto with a Bachelor of Applied Science in Engineering Science with a specialization in Machine Intelligence."
          ]
        }
      ]
    },
    {
      "Genre": "Projects",
      "Experiences": [
        {
          "Name": "KOKKAI DOC",
          "Start": "2023-06-01",
          "End": "Present",
          "key": "kokkaidoc",
          "RelatedLinks": ["https://kokkaidoc.com"],
          "Keywords": [
            "NLP",
            "LLM",
            "AI",
            "Data Science",
            "Data Visualization",
            "Finetuning",
            "React",
            "Political Methodology",
            "Startup",
            "Founder",
            "Frontend Development",
            "Backend Development"
          ],
          "Descriptions": [
            "KOKKAI DOC is a platform that I founded which aims to make Japanese politics more transparent to the public through the use of AI/LLMs and data science",
            "The platform uses a fine-tuned LLM to analyze the speeches of Japanese legislators and predict their ideological stances in regards to various political topics",
            "The platform also provides a intuitive GUI enabling users to look up the speeches of representatives from various electoral districts and compare their stances on various topics",
            "I have also scraped the voting data of parliamentary representatives and visualized them in a more intuitive way to help users understand the voting patterns of the representatives and parties"
          ],
          "videoLink": "https://www.youtube.com/embed/dN-Hmjzhhww?si=ynT2qbqNZtWozfeU"
        },
        {
          "Name": "AI Website Builder",
          "Start": "2024-11-01",
          "End": "2024-11-15",
          "key": "aiwebsitebuilder",
          "Keywords": [
            "LLM",
            "AI",
            "React",
            "Frontend Development",
            "Backend Development",
            "Node.JS",
            "TypeScript",
            "NextJS",
            "TailwindCSS",
            "MongoDB"
          ],
          "Descriptions": [
            "Developed an AI-powered web application enabling non-technical users to create and edit HTML/CSS websites through natural language interactions with an AI assistant. ",
            "Frontend: Built with Next.js, TypeScript, and TailwindCSS for a responsive and modern UI. ",
            "Backend: Developed using Node.js with Express and TypeScript, acting as an intermediary between the frontend and OpenAI's API. ",
            "Database: Utilized MongoDB to store user sessions, including generated HTML/CSS, AI interactions, and metadata.",
            "Users can create accounts, authenticate via JWT, and store session histories.",
            "Ensured scalable deployment using Docker Compose, containerizing all components for seamless setup and execution. "
          ],
          "videoLink": "https://www.youtube.com/embed/NvvZ0OytMM4?si=HCLUhRtwidGBg_As"
        },
        {
          "Name": "Diary CRUD Application with React and Django",
          "RelatedLinks": [
            "https://github.com/kkatodus/diary_app_react-django"
          ],
          "Start": "2021-06",
          "End": "2021-07",
          "key": "diary",
          "Keywords": [
            "React",
            "Django",
            "CRUD",
            "Web Development",
            "Python",
            "Backend Development",
            "Frontend Development"
          ],
          "videoLink": "https://www.youtube.com/embed/fzO0WR2NVC8?si=ZIk65VDbTYY2QWGi"
        },
        {
          "Name": "School Reunion CRUD Social Media Platform using Django, HTML, CSS, JS",
          "RelatedLinks": ["https://github.com/kkatodus/school_reunion_site"],
          "videoLink": "https://www.youtube.com/embed/LjWDzGAYc-E?si=V654Mnrv4Q3vBMfX",
          "Start": "2020-11",
          "End": "2021-01",
          "key": "reunion",
          "Keywords": [
            "HTML/CSS/JS",
            "Django",
            "CRUD",
            "Web Development",
            "Python",
            "Backend Development",
            "Frontend Development"
          ],
          "Descriptions": []
        }
      ]
    },

    {
      "Genre": "Publications",
      "Experiences": [
        {
          "Name": "KOKKAI DOC: An LLM-driven framework for scaling parliamentary representatives",
          "Start": "2024-09",
          "End": "2025-04",
          "key": "kokkaidoc pub",
          "Keywords": [
            "JSQPS 2025",
            "AI",
            "LLM",
            "NLP",
            "Political Science",
            "Publication",
            "Political Methodology",
            "Political Science"
          ],
          "RelatedLinks": ["https://arxiv.org/abs/2505.07118"],
          "Descriptions": [
            "This paper introduces an LLM-driven framework designed to accurately scale the political issue stances of parliamentary representatives. By leveraging advanced natural language processing techniques and large language models, the proposed methodology refines and enhances previous approaches by addressing key challenges such as noisy speech data, manual bias in selecting political axes, and the lack of dynamic, diachronic analysis. The framework incorporates three major innovations: (1) de-noising parliamentary speeches via summarization to produce cleaner, more consistent opinion embeddings; (2) automatic extraction of axes of political controversy from legislators’ speech summaries; and (3) a diachronic analysis that tracks the evolution of party positions over time. \nWe conduct quantitative and qualitative evaluations to verify our methodology. Quantitative evaluations demonstrate high correlation with expert predictions across various political topics, while qualitative analyses reveal meaningful associations between language patterns and political ideologies. This research aims to have an impact beyond the field of academia by making the results accessible by the public on teh web application: kokkaidoc.com. We are hoping that through our application, Japanese voters can gain a data-driven insight into the political landscape which aids them to make more nuanced voting decisions. \n Overall, this work contributes to the growing body of research that applies LLMs in political science, offering a flexible and reliable framework for scaling political positions from parliamentary speeches. But also explores the practical applications of the research in the real world to have real world impact. "
          ]
        },
        {
          "Name": "L(u)PIN: LLM-based Political Ideology Nowcasting",
          "Start": "2023-10",
          "End": "2024-04",
          "key": "lupin",
          "Keywords": [
            "AI",
            "LLM",
            "NLP",
            "Political Science",
            "Publication",
            "Political Methodology",
            "PolMeth2024",
            "Political Science"
          ],
          "RelatedLinks": ["https://arxiv.org/abs/2405.07320"],
          "Descriptions": [
            "The quantitative analysis of political ideological positions is a difficult task. In the past, various literature focused on parliamentary voting data of politicians, party manifestos and parliamentary speech to estimate political disagreement and polarization in various political systems. However previous methods of quantitative political analysis suffered from a common challenge which was the amount of data available for analysis. Also previous methods frequently focused on a more general analysis of politics such as overall polarization of the parliament or party-wide political ideological positions. In this paper, we present a method to analyze ideological positions of individual parliamentary representatives by leveraging the latent knowledge of LLMs. The method allows us to evaluate the stance of politicians on an axis of our choice allowing us to flexibly measure the stance of politicians in regards to a topic/controversy of our choice. We achieve this by using a fine-tuned BERT classifier to extract the opinion-based sentences from the speeches of representatives and projecting the average BERT embeddings for each representative on a pair of reference seeds. These reference seeds are either manually chosen representatives known to have opposing views on a particular topic or they are generated sentences which where created using the GPT-4 model of OpenAI. We created the sentences by prompting the GPT-4 model to generate a speech that would come from a politician defending a particular position."
          ]
        },
        {
          "Name": "NIFTY Financial News Headlines Dataset",
          "Start": "2023-11",
          "End": "2024-04",
          "key": "nifty",
          "RelatedLinks": ["https://arxiv.org/abs/2405.09747"],
          "Keywords": [
            "NLP",
            "LLM",
            "Finance",
            "Prompt Engineering",
            "Publication"
          ],
          "Descriptions": [
            "We introduce and make publicly available the NIFTY Financial News Headlines dataset, designed to facilitate and advance research in financial market forecasting using large language models (LLMs). This dataset comprises two distinct versions tailored for different modeling approaches: (i) NIFTY-LM, which targets supervised fine-tuning (SFT) of LLMs with an auto-regressive, causal language-modeling objective, and (ii) NIFTY-RL, formatted specifically for alignment methods (like reinforcement learning from human feedback (RLHF)) to align LLMs via rejection sampling and reward modeling. Each dataset version provides curated, high-quality data incorporating comprehensive metadata, market indices, and deduplicated financial news headlines systematically filtered and ranked to suit modern LLM frameworks. We also include experiments demonstrating some applications of the dataset in tasks like stock price movement and the role of LLM embeddings in information acquisition/richness. The NIFTY dataset along with utilities (like truncating prompt's context length systematically) are available on Hugging Face at this https URL."
          ]
        },
        {
          "Name": "Missing Links A comparison of search censorship in China",
          "Start": "2022-05",
          "key": "missing",
          "End": "2023-02",
          "Keywords": [
            "Censorship",
            "NLP",
            "Data Science",
            "Web Scraping",
            "New York Times",
            "Research",
            "Publication"
          ],
          "RelatedLinks": [
            "https://citizenlab.ca/2023/04/a-comparison-of-search-censorship-in-china/",
            "https://www.nytimes.com/2023/04/26/business/china-censored-search-engine.html"
          ],
          "Descriptions": [
            "Across eight China-accessible search platforms analyzed — Baidu, Baidu Zhidao, Bilibili, Microsoft Bing, Douyin, Jingdong, Sogou, and Weibo — we discovered over 60,000 unique censorship rules used to partially or totally censor search results returned on these platforms.",
            "We investigated different levels of censorship affecting each platform, which might either totally block all results or selectively allow some through, and we applied novel methods to unambiguously and exactly determine the rules triggering each of these types of censorship across all platforms.",
            "Among web search engines Microsoft Bing and Baidu, Bing’s chief competitor in China, we found that, although Baidu has more censorship rules than Bing, Bing’s political censorship rules were broader and affected more search results than Baidu. Bing on average also restricted displaying search results from a greater number of website domains.",
            "These findings call into question the ability of non-Chinese technology companies to better resist censorship demands than their Chinese counterparts and serve as a dismal forecast concerning the ability of other non-Chinese technology companies to introduce search products or other services in China without integrating at least as many restrictions on political and religious expression as their Chinese competitors."
          ]
        }
      ]
    },
    {
      "Genre": "Awards",
      "Experiences": [
        {
          "Name": "CIE IE+ Award",
          "Company": "University of Toronto",
          "key": "uoft",

          "Start": "2024-05-01",
          "End": "2024-08-31",
          "RelatedLinks": [
            "https://learningabroad.utoronto.ca/learning-abroad/prepare_plan/funding/centre-for-international-experience/"
          ],
          "Keywords": []
        },
        {
          "Name": "ESROP-GLOBAL Award",
          "Company": "University of Toronto",
          "key": "uoft",

          "Start": "2024-05-01",
          "End": "2024-08-31",
          "RelatedLinks": [
            "https://engsci.utoronto.ca/research-and-work/summer-research/esrop-global/"
          ],
          "Keywords": []
        },
        {
          "Name": "ESROP-E4TW Award",
          "Company": "University of Toronto",
          "key": "uoft",
          "Start": "2022-05-01",
          "End": "2022-08-31",
          "RelatedLinks": [
            "https://engsci.utoronto.ca/research-and-work/summer-research/esrop-e4tw/"
          ],
          "Keywords": []
        }
      ]
    }
  ]
}
